In [1]:
import pandas as pd
df = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [2]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

#### How many number of males and females

In [3]:
df["Sex"].value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [5]:
len(df[df["Sex"] == "male"])

577

In [6]:
len(df[df["Sex"] == "female"])

314

In [7]:
df.groupby('Sex')['Sex'].count()

Sex
female    314
male      577
Name: Sex, dtype: int64

#### Number of people survived

In [9]:
df["Survived"].value_counts() # 0 for not survived and 1 for survived

0    549
1    342
Name: Survived, dtype: int64

In [11]:
len(df[df["Survived"] == 1])

342

#### How many casualities we have

In [13]:
len(df[df["Survived"] == 0])

549

#### Find the name of the eldest person

In [15]:
df[df["Age"] == df["Age"].max()]["Name"]

630    Barkworth, Mr. Algernon Henry Wilson
Name: Name, dtype: object

#### Number of people in different classes

In [16]:
df["Pclass"].value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [17]:
df.groupby("Pclass")["Pclass"].count()

Pclass
1    216
2    184
3    491
Name: Pclass, dtype: int64

#### Number of people whose name starts with 's'

In [23]:
len(df[df["Name"].str.startswith('S')])

86

#### Add a new column with summation of SibSp and Parch

In [25]:
df["New"] = df["SibSp"] + df["Parch"]

In [26]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,New
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0

#### Number of people whose age is below 25

In [28]:
len(df[df["Age"] < 25])

278

#### Number of people whose age is below 40 and died

In [30]:
len(df[(df["Survived"] == 0) & (df["Age"] < 40)])

322

#### Seperate text and number from Cabin column

In [31]:
df["CabinNumber"] = df["Cabin"].str.replace("([A-Za-z]+)","")
df["CabinString"] = df["Cabin"].str.extract("([A-Za-z]+)")

C:\Users\ADMIN\AppData\Local\Temp/ipykernel_8632/3729999842.py:1: FutureWarning: The default value of regex will change from True to False in a future version.
  df["CabinNumber"] = df["Cabin"].str.replace("([A-Za-z]+)","")

In [32]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,New,CabinNumber,CabinString
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1,NaN,NaN
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1,85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,NaN,NaN
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1,123,C
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0,NaN,NaN